YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/IoHwAb_R44/delivery/inc/IoHwAb_Util.h
/*******************************************************************************
**                                                                            **
**  (C) 2021 HYUNDAI AUTOEVER Corp.                                           **
**  Confidential Proprietary Information. Distribution Limited.               **
**  This source code is permitted to be used only in projects contracted      **
**  with Hyundai Autoever, and any other use is prohibited.                   **
**  If you use it for other purposes or change the source code,               **
**  you may take legal responsibility.                                        **
**  In this case, There is no warranty and technical support.                 **
**                                                                            **
**  SRC-MODULE: IoHwAb_Util.h                                                 **
**                                                                            **
**  TARGET    : All                                                           **
**                                                                            **
**  PRODUCT   : AUTOSAR IOHWAB                                                **
**                                                                            **
**  PURPOSE   : Time constant definitions for IOHWAB                          **
**                                                                            **
**  PLATFORM DEPENDANT [yes/no]: no                                           **
**                                                                            **
**  TO BE CHANGED BY USER [yes/no]: no                                        **
**                                                                            **
*******************************************************************************/

/*******************************************************************************
**                      Revision History                                      **
********************************************************************************
** Revision  Date          By               Description                       **
********************************************************************************
** 1.7.0     05-Mar-2024  YongEun.Lee       #CP44-3784                        **
** 1.6.2     15-Aug-2023  KhaLN1            #CP44-2683, #CP44-2684            **
** 1.6.0     07-Jul-2023  KhaLN1            #CP44-2241                        **
** 1.4.0.1   21-Sep-2022  Manje.Woo         #CP44-859                         **
** 1.4.0     22-Aug-2022  KhaLN1            #CP44-485                         **
** 1.3.0.1   30-Jun-2022  KhaLN1            #CP44-365                         **
** 1.3.0     16-Mar-2022  PhucNHM           R44-Redmine #24320                **
** 1.2.0     18-Nov-2021  PhucNHM           R44-Redmine #18098                **
** 1.1.0     15-Jul-2021  YangJin.Kim       R44-Redmine #18100                **
** 1.0.1     26-Feb-2020  YangJin.Kim       R40-Redmine #28531                **
** 1.0.0     04-Dec-2020  YangJin.Kim       R40-Redmine #26992                **
*******************************************************************************/
#ifndef IOHWAB_UTIL_H
#define IOHWAB_UTIL_H

/*******************************************************************************
**                      Include Section                                       **
*******************************************************************************/
#include "IoHwAb_Cfg.h"

#if defined(IOHWAB_MCAL_FREESCALE_MPC560XB)
#include "Reg_eSys_Stm.h"
#include "Reg_eSys_Rtc.h"
#include "Reg_eSys_SIUL.h"
#include "Reg_eSys_ADCDig.h"
#include "Reg_Macros.h"

#elif defined(IOHWAB_MCAL_ST_SPC58XCX)
#include "Reg_eSys_Stm.h"
#include "Reg_eSys_Rtc.h"
#include "Reg_eSys_SIUL.h"
#include "Reg_eSys_ADCDigv2.h"
#include "Reg_Macros.h"

#elif (defined(IOHWAB_MCAL_INFINEON_TC21X) || defined(IOHWAB_MCAL_INFINEON_TC22X) \
    || defined(IOHWAB_MCAL_INFINEON_TC23X) || defined(IOHWAB_MCAL_INFINEON_TC26X) \
    || defined(IOHWAB_MCAL_INFINEON_TC27X) || defined(IOHWAB_MCAL_INFINEON_TC29X) \
    || defined(IOHWAB_MCAL_INFINEON_TC33X) || defined(IOHWAB_MCAL_INFINEON_TC36X) \
    || defined(IOHWAB_MCAL_INFINEON_TC37X) || defined(IOHWAB_MCAL_INFINEON_TC38X) \
    || defined(IOHWAB_MCAL_INFINEON_TC39X))
#include "Os_Arch_Regs.h"
#include "IfxPort_reg.h"
#include "IfxSrc_reg.h"

#elif (defined(IOHWAB_MCAL_CYPRESS_S6J32XX))
#include "s6j3200_ADC12B.h"
#include "Adc_Stream.h"
#include "s6j3200_RLT.h"

#elif (defined(IOHWAB_MCAL_CYPRESS_S6J33XX))
#include "s6j3300_ADC12B.h"
#include "Adc_Stream.h"
#include "s6j3300_RLT.h"

#elif (defined(IOHWAB_MCAL_FREESCALE_MPC574XR))
#include "Adc_Reg_eSys_Adcdig.h"
#include "Reg_eSys_Stm.h"
#include "Reg_eSys_Rtc.h"
#include "Reg_eSys_SIUL2.h"
#include "StdRegMacros.h"

#elif (defined(IOHWAB_MCAL_RENESAS_RH850F1L) || defined(IOHWAB_MCAL_RENESAS_RH850F1L_413) \
    || defined(IOHWAB_MCAL_RENESAS_RH850F1K) || defined(IOHWAB_MCAL_RENESAS_RH850F1KM))
#include "Adc_Private.h"

#elif (defined(IOHWAB_MCAL_RENESAS_RH850U2A))
#include "Adc_Cfg.h"
#include ADC_HWIP_PBTYPES_H_FILE
#include "Adc_PBTypes.h"
#include "Adc_LLDriver.h"

#elif (defined(IOHWAB_MCAL_NXP_S32K14X))
#include "Os.h"
#include "StdRegMacros.h"
#include "Adc_Reg_eSys_Adc12bsarv2.h"

#elif (defined(IOHWAB_MCAL_NXP_S32G2X))
#include "Reg_eSys_Rtc.h"
#include "Os.h"
#include "StdRegMacros.h"

#elif(defined(IOHWAB_MCAL_CYPRESS_CYTXXX))
#include "Adc_Data.h"
#include "Adc_Internal.h"
#include "Adc_Regs.h"

#endif


/*******************************************************************************
**                      Global Data                                           **
*******************************************************************************/
/* Multiple to convert sec to msec */
#define IOHWAB_SEC_TO_MSEC      (1000u)

/* Multiple to convert msec to usec */
#define IOHWAB_MSEC_TO_USEC     (1000u)

/* Multiple to convert sec to usec */
#define IOHWAB_SEC_TO_USEC      (1000000u)

typedef uint32	IoHwAb_DelayUsecType;
typedef uint16	IoHwAb_DelayMsecType;
typedef float32 IoHwAb_DelaySecType;

