YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/IoHwAb_R44/delivery/inc/IoHwAb_Util.h
typedef uint32	IoHwAb_StmTickType;
typedef uint32	IoHwAb_GptTickType;
#if (defined(IOHWAB_MCAL_FREESCALE_MPC560XB) || (defined(IOHWAB_MCAL_ST_SPC58XCX)))
/* polyspace:begin<MISRA-C:1.1:Not a defect:Justify with annotations> No Impact of this rule violation */
typedef unsigned long long  IoHwAb_LongType;
/* polyspace:end<MISRA-C:1.1:Not a defect:Justify with annotations> No Impact of this rule violation */
#elif (defined(IOHWAB_MCAL_INFINEON_TC21X) || defined(IOHWAB_MCAL_INFINEON_TC22X) \
    || defined(IOHWAB_MCAL_INFINEON_TC23X) || defined(IOHWAB_MCAL_INFINEON_TC26X) \
    || defined(IOHWAB_MCAL_INFINEON_TC27X) || defined(IOHWAB_MCAL_INFINEON_TC29X) \
    || defined(IOHWAB_MCAL_INFINEON_TC33X) || defined(IOHWAB_MCAL_INFINEON_TC36X) \
    || defined(IOHWAB_MCAL_INFINEON_TC37X) || defined(IOHWAB_MCAL_INFINEON_TC38X) \
    || defined(IOHWAB_MCAL_INFINEON_TC39X))
typedef uint32  IoHwAb_LongType;
#elif (defined(IOHWAB_MCAL_RENESAS_RH850F1L) || defined(IOHWAB_MCAL_RENESAS_RH850F1L_413) \
    || defined(IOHWAB_MCAL_RENESAS_RH850F1K) || defined(IOHWAB_MCAL_RENESAS_RH850F1KM))
typedef uint8  IoHwAb_StmStatusType;
typedef uint32 IoHwAb_LongType;

#elif (defined(IOHWAB_MCAL_RENESAS_RH850U2A))
typedef uint32 IoHwAb_LongType;

#elif (defined(IOHWAB_MCAL_CYPRESS_S6J33XX))
typedef uint32 IoHwAb_LongType;

#endif

/*******************************************************************************
**                      Mcu Dependent Macros                                  **
*******************************************************************************/
/* polyspace:begin<MISRA-C:11.3:Not a defect:Justify with annotations> No Impact of this rule violation */
/* polyspace:begin<MISRA-C:19.7:Not a defect:Justify with annotations> No Impact of this rule violation */
/* polyspace-begin MISRA-C3:10.7 [Justified:Low] "Validated by test cases. It works as intended." */
/* Freescale Bolero */
#if (defined(IOHWAB_MCAL_FREESCALE_MPC560XB) || (defined(IOHWAB_MCAL_ST_SPC58XCX)))
#define IOHWAB_MCU_CLK_DIV      (4U)
#define IOHWAB_STM_FREQ_HZ      (1000000u) /* 64M/64 */
#define IOHWAB_GPT_FREQ_HZ      (1000000u) /* 64M/64 */
/* Upper limit of STM ticks */
#define IOHWAB_STM_TICK_MAX     ((IoHwAb_StmTickType) STM_CNT_MAX_VALUE)
/* Upper limit of GPT ticks */
#define IOHWAB_GPT_TICK_MAX     ((IoHwAb_GptTickType) RTC_API_RTCC_APIVAL_MAX_VALUE)

#define IOHWAB_NOP()            do{__asm("  nop");} \
                                while(0)
#define IOHWAB_ADC_ISR_ECH      (0x00000001U)

#if (ADC_SW_MAJOR_VERSION_REG > 1)
  #define IOHWAB_ADC_CONV_COMPLETED(ADC_HWUNIT_NUM) \
      (REG_READ32(ADC_ISR_REG(ADC_ADDRESS(ADC_HWUNIT_NUM)))&(IOHWAB_ADC_ISR_ECH))
  #define IOHWAB_ADC_ACKNOWLEDGED(ADC_HWUNIT_NUM) \
      (REG_WRITE32( ADC_ISR_REG(ADC_ADDRESS(ADC_HWUNIT_NUM)),IOHWAB_ADC_ISR_ECH))
#else
  #define IOHWAB_ADC_CONV_COMPLETED(ADC_HWUNIT_NUM) \
      (REG_READ32(ADC_ISR_REG(ADC_HWUNIT_NUM))&(IOHWAB_ADC_ISR_ECH))
  #define IOHWAB_ADC_ACKNOWLEDGED(ADC_HWUNIT_NUM) \
      (REG_WRITE32( ADC_ISR_REG(ADC_HWUNIT_NUM),IOHWAB_ADC_ISR_ECH))
#endif

/* Bolero do not need.*/
/* #define IOHWAB_ADC_CONV_PROC(ADC_HWUNIT_NUM)  IOHWAB_NOP() */

/* Infineon AURIX */
#elif (defined(IOHWAB_MCAL_INFINEON_TC21X) || defined(IOHWAB_MCAL_INFINEON_TC22X) \
    || defined(IOHWAB_MCAL_INFINEON_TC23X) || defined(IOHWAB_MCAL_INFINEON_TC26X) \
    || defined(IOHWAB_MCAL_INFINEON_TC27X) || defined(IOHWAB_MCAL_INFINEON_TC29X))
extern uint32 Os_GulStmClock;
#define IOHWAB_STM_FREQ_HZ      (Os_GulStmClock * 1000000)
#define IOHWAB_GPT_FREQ_HZ      (24414u)  /* GTM_FIXED_CLOCK_3 : 100MHz / 2^12 */
#define IOHWAB_NOP()            __nop()
#define IOHWAB_GET_TIMESTAMP()  OS_STM0_TIM0.U
#define IOHWAB_ADC_CONV_BASE_ADDRESS 0xF0038984ul
#define IOHWAB_ADC_CONV_COMPLETED(ADC_HWUNIT_NUM) \
(((uint32)(*(volatile uint32*)(IOHWAB_ADC_CONV_BASE_ADDRESS + (0x10u*(ADC_HWUNIT_NUM)))))&(((uint32)1U)<<24))
#define IOHWAB_ADC_ACKNOWLEDGED(ADC_HWUNIT_NUM) \
do{(((*(volatile uint32*)(IOHWAB_ADC_CONV_BASE_ADDRESS + (0x10u*(ADC_HWUNIT_NUM)))))|=(((uint32)1U)<<25));} \
while(0)
#define IOHWAB_ADC_CONV_PROC(ADC_HWUNIT_NUM)  do{Adc_IsrSrn1AdcRS1(ADC_HWUNIT_NUM);}\
while(0)

/* TC38X, TC39X */
#elif (defined(IOHWAB_MCAL_INFINEON_TC33X)) || (defined(IOHWAB_MCAL_INFINEON_TC36X)) \
   || (defined(IOHWAB_MCAL_INFINEON_TC37X)) || (defined(IOHWAB_MCAL_INFINEON_TC38X)) \
   || (defined(IOHWAB_MCAL_INFINEON_TC39X))
extern uint32 Os_GulStmClock;
#define IOHWAB_STM_FREQ_HZ      (Os_GulStmClock * 1000000)
#define IOHWAB_GPT_FREQ_HZ      (24414u)  /* GTM_FIXED_CLOCK_3 : 100MHz / 2^12 */
#define IOHWAB_NOP()            __nop()
#define IOHWAB_GET_TIMESTAMP()  OS_STM0_TIM0.U
#ifndef TESTING_MODE
#define IOHWAB_ADC_CONV_BASE_ADDRESS 0xF0038670u
#define IOHWAB_ADC_CONV_COMPLETED(ADC_HWUNIT_NUM) \
(((uint32)(*(volatile uint32*)(IOHWAB_ADC_CONV_BASE_ADDRESS + (0x10u*(ADC_HWUNIT_NUM)))))&(((uint32)1U)<<24))
#define IOHWAB_ADC_ACKNOWLEDGED(ADC_HWUNIT_NUM) \
do{(((*(volatile uint32*)(IOHWAB_ADC_CONV_BASE_ADDRESS + (0x10u*(ADC_HWUNIT_NUM)))))|=(((uint32)1U)<<25));}\
while(0)
#endif
#define IOHWAB_ADC_CONV_PROC(ADC_HWUNIT_NUM)  do{Adc_RS0EventInterruptHandler(ADC_HWUNIT_NUM);}\
while(0)

/* Renesas RH850F1L */
#elif (defined(IOHWAB_MCAL_RENESAS_RH850F1L) || defined(IOHWAB_MCAL_RENESAS_RH850F1L_413))
#define IOHWAB_MCU_CLK_DIV      (6U)
#define IOHWAB_STM_FREQ_HZ      (8000000u) /* 8M/80 */
#define IOHWAB_GPT_FREQ_HZ      (8000000u) /* 8M/80 */

#define IOHWAB_NOP()            do{__asm("nop");}\
while(0)

#define IOHWAB_ADC_CONV_BASE_ADDRESS 0xFFFF9014ul

/* Incase of INT sequence */
/* SG1 only for AdcReadDirect */
#define IOHWAB_ADC_CONV_COMPLETED(ADC_HWUNIT_NUM) \
((uint32)(*(volatile uint32*)(0xfff20308ul + (0x1000ul*(ADC_HWUNIT_NUM)))&((uint32)0x0002u)))
#define IOHWAB_ADC_ACKNOWLEDGED(ADC_HWUNIT_NUM) \
do{(((*(volatile uint16*)(IOHWAB_ADC_CONV_BASE_ADDRESS + (0x1186ul*(ADC_HWUNIT_NUM)))))&=( (uint16)0xEFFFu ));}\
while(0)
#define IOHWAB_ADC_CONV_PROC( ADC_HWUNIT_NUM )  do{Adc_Isr( (uint8)(ADC_HWUNIT_NUM), 0U );}\
while(0)

