YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/IoHwAb_R44/delivery/inc/IoHwAb_Util.h
/* Renesas RH850F1K */
#elif (defined(IOHWAB_MCAL_RENESAS_RH850F1K) || defined(IOHWAB_MCAL_RENESAS_RH850F1KM)) 
#define IOHWAB_MCU_CLK_DIV      (6U)
#define IOHWAB_STM_FREQ_HZ      (8000000u) /* 8M/80 */
#define IOHWAB_GPT_FREQ_HZ      (8000000u) /* 8M/80 */

#define IOHWAB_NOP()            do{__asm("nop");}\
while(0)


#define IOHWAB_ADC_CONV_BASE_ADDRESS 0xFFFEEA24ul

/* Incase of INT sequence */
/* SG1 only for AdcReadDirect */
#define IOHWAB_ADC_CONV_COMPLETED(ADC_HWUNIT_NUM) \
(uint32)((*(volatile uint32*)(0xffd6d308ul + (0x1b3000ul*(((ADC_HWUNIT_NUM)+1u)&0x0001u))))&((uint32)0x0002u))

#define IOHWAB_ADC_ACKNOWLEDGED(ADC_HWUNIT_NUM) \
do{(((*(volatile uint16*)(IOHWAB_ADC_CONV_BASE_ADDRESS + (0xc786ul*(ADC_HWUNIT_NUM)))))&=( (uint16)0xEFFFu ));}\
while(0)

#define IOHWAB_ADC_CONV_PROC(ADC_HWUNIT_NUM)  do{Adc_Isr( (uint8)(ADC_HWUNIT_NUM), 0U );}\
while(0)

/* Renesas RH850U2A */
#elif (defined(IOHWAB_MCAL_RENESAS_RH850U2A)) 
#define IOHWAB_STM_FREQ_HZ      (80000000u) /* 80M */
#define IOHWAB_GPT_FREQ_HZ      (10000000u) /* 80M/8 */

#define IOHWAB_NOP()            do{__asm("nop");}\
while(0)

/* EIC227 : SG0 end interrupt control*/
#define IOHWAB_ADC_CONV_BASE_ADDRESS 0xFFF801C6ul

/* Incase of INT sequence */
/* SG0 only for AdcReadDirect */
#define IOHWAB_ADC_CONV_COMPLETED(ADC_HWUNIT_NUM) \
(uint32)((*(volatile uint16*)(IOHWAB_ADC_CONV_BASE_ADDRESS + (0xCul*(ADC_HWUNIT_NUM))))&(0x1000u))

#define IOHWAB_ADC_ACKNOWLEDGED(ADC_HWUNIT_NUM) \
do{(((*(volatile uint16*)(IOHWAB_ADC_CONV_BASE_ADDRESS + (0xCul*(ADC_HWUNIT_NUM)))))&=( (uint16)0xEFFFu ));}\
while(0)

#define IOHWAB_ADC_CONV_PROC(ADC_HWUNIT_NUM)  do{Adc_Isr( (uint8)(ADC_HWUNIT_NUM), (uint8)(ADC_HWUNIT_NUM) );}\
while(0)


/* Cypress S6J3200 */
#elif (defined(IOHWAB_MCAL_CYPRESS_S6J32XX))
#define IOHWAB_MCU_CLK_DIV      (6U)
#define IOHWAB_STM_FREQ_HZ      (1000000u) /* 64M/64 */
#define IOHWAB_GPT_FREQ_HZ      (1000000u) /* 64M/64 */

#define IOHWAB_ADC_CONV_BASE_ADDRESS 0xB48C0300UL /* ADC12B0_CDONEIRQ0 */

#define IOHWAB_ADC_CONV_COMPLETED(ADC_HWUNIT_NUM) \
(uint32)( (*(volatile uint32*)(0xB48C0300UL)) + (*(volatile uint32*)(0xB48C0304UL)) )
#define IOHWAB_ADC_ACKNOWLEDGED(ADC_HWUNIT_NUM) do{}\
while(0)

#define IOHWAB_ADC_CONV_PROC(ADC_HWUNIT_NUM)  do{Adc_IsrGroupConversionFinished(ADC_HWUNIT_NUM);}\
while(0)



/* Cypress S6J3300 */
#elif (defined(IOHWAB_MCAL_CYPRESS_S6J33XX))
#define IOHWAB_MCU_CLK_DIV      (6U)
#define IOHWAB_STM_FREQ_HZ      (1000000u) /* 64M/64 */
#define IOHWAB_GPT_FREQ_HZ      (1000000u) /* 64M/64 */

#define IOHWAB_NOP()            
#define IOHWAB_ADC_CONV_BASE_ADDRESS 0xB48C0300UL /* ADC12B0_CDONEIRQ0 */

#define IOHWAB_ADC_CONV_COMPLETED(ADC_HWUNIT_NUM) \
(uint32)( (*(volatile uint32*)(0xB48C0300UL)) + (*(volatile uint32*)(0xB48C0304UL)) )
#define IOHWAB_ADC_ACKNOWLEDGED(ADC_HWUNIT_NUM) do{}\
while(0)

#define IOHWAB_ADC_CONV_PROC(ADC_HWUNIT_NUM)  do{Adc_IsrGroupConversionFinished(ADC_HWUNIT_NUM);}\
while(0)

/* Freescale MPC574XR */
#elif (defined(IOHWAB_MCAL_FREESCALE_MPC574XR))
#define IOHWAB_MCU_CLK_DIV      (4U)
#define IOHWAB_STM_FREQ_HZ      (1000000u) 
#define IOHWAB_GPT_FREQ_HZ      (1000000u) 

#define IOHWAB_NOP()            do{__asm("  nop");}\
while(0)
#define IOHWAB_ADC_CONV_COMPLETED(ADC_HWUNIT_NUM) \
        (REG_READ32(ADCDIG_ISR_REG_ADDR32(ADC_HWUNIT_NUM))&(ADCDIG_ISR_END_CHAIN_NORM_CLEAN_U32))
#define IOHWAB_ADC_ACKNOWLEDGED(ADC_HWUNIT_NUM) \
        (REG_WRITE32( ADCDIG_ISR_REG_ADDR32(ADC_HWUNIT_NUM),ADCDIG_ISR_END_CHANNEL_NORM_CONV_U32))

#elif (defined(IOHWAB_MCAL_NXP_S32K14X))
#define IOHWAB_MCU_CLK_DIV      (4U)
#define IOHWAB_STM_FREQ_HZ      (1000000u) /* 64M/64 */
#define IOHWAB_GPT_FREQ_HZ      (1000000u) /* 64M/64 */
/* Upper limit of STM ticks */
#define IOHWAB_STM_TICK_MAX     ((IoHwAb_StmTickType) STM_CNT_MAX_VALUE)
/* Upper limit of GPT ticks */
#define IOHWAB_GPT_TICK_MAX     ((IoHwAb_GptTickType) RTC_API_RTCC_APIVAL_MAX_VALUE)

#define IOHWAB_NOP()            do { \
                                  __asm("  nop"); \
                                }while(0)
#define IOHWAB_ADC_CONV_COMPLETED(ADC_HWUNIT_NUM, ADC_GROUP_LENGH)  (REG_READ32(ADC12BSARV2_SC1_REG_ADDR32((ADC_HWUNIT_NUM), (uint32)ADC_GROUP_LENGH)) & (0x00000080UL))

#define IOHWAB_ADC_ACKNOWLEDGED(ADC_HWUNIT_NUM) ((*(volatile uint32*)((ADC12BSARV2_SC1_REG_ADDR32((ADC_HWUNIT_NUM), (uint32)0)))) &= (0xFFFFFFFFUL - 0xC0UL) )

/* NXP S32G2X */
#elif (defined(IOHWAB_MCAL_NXP_S32G2X))
#define IOHWAB_MCU_CLK_DIV      (4U)
#define IOHWAB_STM_FREQ_HZ      (1000000u) /* 64M/64 */
#define IOHWAB_GPT_FREQ_HZ      (1000000u) /* 64M/64 */
/* Upper limit of STM ticks */
#define IOHWAB_STM_TICK_MAX     ((IoHwAb_StmTickType) STM_CNT_MAX_VALUE_U32)
/* Upper limit of GPT ticks */
#define IOHWAB_GPT_TICK_MAX     ((IoHwAb_GptTickType) RTC_API_RTCC_APIVAL_MAX_VALUE_U32)

#define IOHWAB_NOP()            do { \
                                  __asm("  nop"); \
                                }while(0)
#ifndef TESTING_MODE
#define IOHWAB_ADC_BASE         (0x401F8000u)
#define IOHWAB_ADC_ISR_OFFSET   (0x00000010u)
#define IOHWAB_ADC_ISR_ADDRESS  (IOHWAB_ADC_BASE + IOHWAB_ADC_ISR_OFFSET)
#define IOHWAB_ADC_HWUNIT_OFFSET (0x000F0000u)

#define IOHWAB_ADC_CONV_COMPLETED(ADC_HWUNIT_NUM) (((uint32)(*(volatile uint32*)((IOHWAB_ADC_ISR_ADDRESS) + (IOHWAB_ADC_HWUNIT_OFFSET*(ADC_HWUNIT_NUM)))))&(((uint32)1U)<<0))

#define IOHWAB_ADC_ACKNOWLEDGED(ADC_HWUNIT_NUM) do { \
                                                  (((*(volatile uint32*)(IOHWAB_ADC_ISR_ADDRESS + (IOHWAB_ADC_HWUNIT_OFFSET*(ADC_HWUNIT_NUM)))))|=(((uint32)1U)<<0)); \
                                                }while(0)
#endif

/* NXP S32K31X */
#elif ((defined(IOHWAB_MCAL_NXP_S32K31X)) || (defined(IOHWAB_MCAL_NXP_S32K31X_3_0_0_P01_HF01)))
#define IOHWAB_MCU_CLK_DIV      (4U)
#define IOHWAB_STM_FREQ_HZ      (1000000u) /* 64M/64 */
#define IOHWAB_GPT_FREQ_HZ      (1000000u) /* 64M/64 */

#define IOHWAB_NOP()            do { \
                                  __asm("  nop"); \
                                }while(0)

#ifndef TESTING_MODE
#define IOHWAB_ADC_BASE         (0x400A0000u)
#define IOHWAB_ADC_ISR_OFFSET   (0x00000010u)
#define IOHWAB_ADC_ISR_ADDRESS  (IOHWAB_ADC_BASE + IOHWAB_ADC_ISR_OFFSET)
#define IOHWAB_ADC_HWUNIT_OFFSET (0x00004000u)

#define IOHWAB_ADC_CONV_COMPLETED(ADC_HWUNIT_NUM) (((uint32)(*(volatile uint32*)((IOHWAB_ADC_ISR_ADDRESS) + (IOHWAB_ADC_HWUNIT_OFFSET*(ADC_HWUNIT_NUM)))))&(((uint32)1U)<<0))

#define IOHWAB_ADC_ACKNOWLEDGED(ADC_HWUNIT_NUM)
#endif

