YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/IoHwAb_R44/delivery/inc/IoHwAb_Util.h
/* Cypress CYTXXX */
#elif (defined(IOHWAB_MCAL_CYPRESS_CYTXXX))
#define IOHWAB_MCU_CLK_DIV      (6U)
#define IOHWAB_STM_FREQ_HZ      (1000000u) /* 64M/64 */
#define IOHWAB_GPT_FREQ_HZ      (1000000u) /* 64M/64 */

#define IOHWAB_ADC_CONV_PROC(ADC_HWUNIT_NUM)  do{Adc_IsrGroupConversionFinished(ADC_HWUNIT_NUM);}\
while(0)

#define IOHWAB_ADC_CONV_COMPLETED(IOHWAB_ADC_BASE_ADDRESS) ((uint32)( (*(volatile uint32*)((IOHWAB_ADC_BASE_ADDRESS) + 0x10UL)) ))

#endif

/*******************************************************************************
**                      Upper limit ticks                                     **
*******************************************************************************/
#if defined(IOHWAB_MCAL_FREESCALE_MPC560XB)
/* Upper limit of GPT time in sec */
#define IOHWAB_GPT_DELAY_MAX_SEC \
    ((IoHwAb_DelaySecType) IOHWAB_GPT_TICK_MAX / IOHWAB_GPT_FREQ_HZ)
#endif


/*******************************************************************************
**                      Convert STM ticks to time                             **
*******************************************************************************/
/* Convert STM ticks to time in sec */
#define IOHWAB_STM_TICK_TO_SEC(tick) \
    (((IoHwAb_DelaySecType) (tick)) / IOHWAB_STM_FREQ_HZ)

/* Convert STM ticks to time in msec */
#define IOHWAB_STM_TICK_TO_MSEC(tick) \
    ((IoHwAb_DelayMsecType) ((((IoHwAb_LongType)(tick))*IOHWAB_SEC_TO_MSEC) / IOHWAB_STM_FREQ_HZ))

/* Convert STM ticks to time in usec */
#define IOHWAB_STM_TICK_TO_USEC(tick) \
    ((IoHwAb_DelayUsecType) ((((uint32)(tick))*IOHWAB_SEC_TO_USEC) / IOHWAB_STM_FREQ_HZ))


/*******************************************************************************
**                      Convert time to STM ticks                             **
*******************************************************************************/
/* Convert Time in sec to STM ticks */
#define IOHWAB_SEC_TO_STM_TICK(time) \
    ((IoHwAb_StmTickType) ((time) * IOHWAB_STM_FREQ_HZ))

/* Convert Time in msec to STM ticks */
#define IOHWAB_MSEC_TO_STM_TICK(time) \
    ((IoHwAb_StmTickType) (((IoHwAb_LongType)(time) * IOHWAB_STM_FREQ_HZ) / IOHWAB_SEC_TO_MSEC))

/* Convert Time in usec to STM ticks */
#define IOHWAB_USEC_TO_STM_TICK(time) \
    ((IoHwAb_StmTickType) (((IoHwAb_LongType)(time) * IOHWAB_STM_FREQ_HZ) / IOHWAB_SEC_TO_USEC))


/*******************************************************************************
**                      Convert GPT ticks to time                             **
*******************************************************************************/
/* Convert GPT ticks to time in sec */
#define IOHWAB_GPT_TICK_TO_SEC(tick) \
    ((IoHwAb_DelaySecType) (tick) / IOHWAB_GPT_FREQ_HZ)

/* Convert GPT ticks to time in msec */
#define IOHWAB_GPT_TICK_TO_MSEC(tick) \
    ((IoHwAb_DelayMsecType) (((IoHwAb_LongType)(tick)*IOHWAB_SEC_TO_MSEC) / IOHWAB_GPT_FREQ_HZ))

/* Convert GPT ticks to time in usec */
#define IOHWAB_GPT_TICK_TO_USEC(tick) \
    ((IoHwAb_DelayUsecType) (((IoHwAb_LongType)(tick)*IOHWAB_SEC_TO_USEC) / IOHWAB_GPT_FREQ_HZ))


/*******************************************************************************
**                      Convert time to GPT ticks                             **
*******************************************************************************/
/* Convert Time in sec to GPT ticks */
#define IOHWAB_SEC_TO_GPT_TICK(time) \
    ((IoHwAb_GptTickType) ((time) * IOHWAB_GPT_FREQ_HZ))
    
/* Convert Time in msec to GPT ticks */
#define IOHWAB_MSEC_TO_GPT_TICK(time) \
    ((IoHwAb_GptTickType) (((IoHwAb_LongType)(time) * IOHWAB_GPT_FREQ_HZ) / IOHWAB_SEC_TO_MSEC))

/* Convert Time in usec to GPT ticks */
#define IOHWAB_USEC_TO_GPT_TICK(time) \
    ((IoHwAb_GptTickType) (((IoHwAb_LongType)(time) * IOHWAB_GPT_FREQ_HZ) / IOHWAB_SEC_TO_USEC))


/*******************************************************************************
**                      Convert between GPT ans STM ticks                     **
*******************************************************************************/
/* Convert STM ticks to GPT ticks */
#define IOHWAB_STM_TICK_TO_GPT_TICK(tick) \
    ((IoHwAb_GptTickType) (((IoHwAb_LongType)(tick) * IOHWAB_GPT_FREQ_HZ) / IOHWAB_STM_FREQ_HZ))

/* Convert GPT ticks to STM ticks */
#define IOHWAB_GPT_TICK_TO_STM_TICK(tick) \
    ((IoHwAb_StmTickType) (((IoHwAb_LongType)(tick) * IOHWAB_STM_FREQ_HZ) / IOHWAB_GPT_FREQ_HZ))


/*******************************************************************************
**                      Current STM Clock in ticks or time                    **
*******************************************************************************/
/* Current STM Clock in ticks */
#if defined(IOHWAB_MCAL_FREESCALE_MPC560XB)
#define IOHWAB_STM_BASE_ADDRESS         (0xFFF3C004UL)
#define IOHWAB_CURRENT_CLOCK_TICK()     ((IoHwAb_StmTickType)(REG_READ32((uint32)IOHWAB_STM_BASE_ADDRESS)))

#elif (defined(IOHWAB_MCAL_INFINEON_TC21X) || defined(IOHWAB_MCAL_INFINEON_TC22X) \
    || defined(IOHWAB_MCAL_INFINEON_TC23X) || defined(IOHWAB_MCAL_INFINEON_TC26X) \
    || defined(IOHWAB_MCAL_INFINEON_TC27X) || defined(IOHWAB_MCAL_INFINEON_TC29X) \
    || defined(IOHWAB_MCAL_INFINEON_TC33X) || defined(IOHWAB_MCAL_INFINEON_TC36X) \
    || defined(IOHWAB_MCAL_INFINEON_TC37X) || defined(IOHWAB_MCAL_INFINEON_TC38X) \
    || defined(IOHWAB_MCAL_INFINEON_TC39X))
#define IOHWAB_CURRENT_CLOCK_TICK()     ((IoHwAb_StmTickType) IOHWAB_GET_TIMESTAMP())

#elif (defined(IOHWAB_MCAL_FREESCALE_MPC574XR))
#define IOHWAB_CURRENT_CLOCK_TICK()     ((IoHwAb_StmTickType) STM_GET_COUNTER())

#elif (defined(IOHWAB_MCAL_RENESAS_RH850F1L) || defined(IOHWAB_MCAL_RENESAS_RH850F1L_413))
#define IOHWAB_CURRENT_CLOCK_TICK()   ((IoHwAb_StmTickType)(*(volatile uint32*)(0xFFEC0004ul))) 

#elif (defined(IOHWAB_MCAL_RENESAS_RH850F1K) || defined(IOHWAB_MCAL_RENESAS_RH850F1KM))
#define IOHWAB_CURRENT_CLOCK_TICK()   ((IoHwAb_StmTickType)(*(volatile uint32*)(0xFFD70004ul))) 

#elif (defined(IOHWAB_MCAL_RENESAS_RH850U2A))
/* OSTM0 counter register */
#define IOHWAB_CURRENT_CLOCK_TICK()   ((IoHwAb_StmTickType)(*(volatile uint32*)(0xFFBF0004ul))) 

#elif (defined(IOHWAB_MCAL_ST_SPC58XCX))
  #if (REG_ESYS_STM_SW_MAJOR_VERSION > 1)
    #define IOHWAB_CURRENT_CLOCK_TICK()   STM_CNT(0xF4068000UL)
  #else
    #define IOHWAB_CURRENT_CLOCK_TICK()   STM_CNT(0)
  #endif

#elif (defined(IOHWAB_MCAL_CYPRESS_S6J32XX))
#define IOHWAB_CURRENT_CLOCK_TICK()   RLT32_TMR

#elif (defined(IOHWAB_MCAL_CYPRESS_S6J33XX))
#define IOHWAB_CURRENT_CLOCK_TICK()   RLT0_TMR

#endif

#ifndef IOHWAB_MCAL_NXP_S32K14X
/* Current STM Clock in sec */
#define IOHWAB_CURRENT_CLOCK_SEC()      (IOHWAB_STM_TICK_TO_SEC(IOHWAB_CURRENT_CLOCK_TICK()))

