YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/IoHwAb_R44/delivery/inc/IoHwAb_Util.h
/* Current STM Clock in msec */
#define IOHWAB_CURRENT_CLOCK_MSEC()     (IOHWAB_STM_TICK_TO_MSEC(IOHWAB_CURRENT_CLOCK_TICK()))

/* Current STM Clock in usec */
#define IOHWAB_CURRENT_CLOCK_USEC()     (IOHWAB_STM_TICK_TO_USEC(IOHWAB_CURRENT_CLOCK_TICK()))
#endif
/*******************************************************************************
**                      DIO Util                                              **
*******************************************************************************/
#if (defined(IOHWAB_MCAL_FREESCALE_MPC560XB)||defined(IOHWAB_MCAL_ST_SPC58XCX))
#define IOHWAB_WRITE_CH(id, value)      do{REG_WRITE8(SIUL_GPDO((id)), (value));}\
while(0)

#elif (defined(IOHWAB_MCAL_INFINEON_TC21X) || defined(IOHWAB_MCAL_INFINEON_TC22X) \
    || defined(IOHWAB_MCAL_INFINEON_TC23X) || defined(IOHWAB_MCAL_INFINEON_TC26X) \
    || defined(IOHWAB_MCAL_INFINEON_TC27X) || defined(IOHWAB_MCAL_INFINEON_TC29X) \
    || defined(IOHWAB_MCAL_INFINEON_TC33X) || defined(IOHWAB_MCAL_INFINEON_TC36X) \
    || defined(IOHWAB_MCAL_INFINEON_TC37X) || defined(IOHWAB_MCAL_INFINEON_TC38X) \
    || defined(IOHWAB_MCAL_INFINEON_TC39X))

#define IOHWAB_WRITE_CH(id, value)      do{(id) = (value);}\
while(0) 

#elif (defined(IOHWAB_MCAL_FREESCALE_MPC574XR))
#define IOHWAB_WRITE_CH(id, value)      do{REG_WRITE8(SIUL2_GPDO_ADDR8((id)), (value));}\
while(0)

#endif

/*******************************************************************************
**                      For MISRA-C                                           **
*******************************************************************************/
#define IOHWAB_UNUSED(x) do { if((uint32)(x) != (uint32)0) {}} while(0)
#define IOHWAB_UNUSED_PTR(x) do { if((x) != NULL_PTR) {}} while(0)
/* polyspace:end<MISRA-C:19.7:Not a defect:Justify with annotations> No Impact of this rule violation */
/* polyspace:end<MISRA-C:11.3:Not a defect:Justify with annotations> No Impact of this rule violation */
/* polyspace-end MISRA-C3:10.7 [Justified:Low] "Validated by test cases. It works as intended." */
#endif /* IOHWAB_UTIL_H */

/*******************************************************************************
**                      End of File                                           **
*******************************************************************************/
